#!/usr/bin/env python
# coding: utf-8

# In[1]:


#ให้เขียนโปรแกรมรับจำนวนเต็มระหว่าง 0 ถึง 99 จากนั้นแสดงแผนภาพฮิสโตแกรมที่แสดงความถี่ของข้อมูล อย่างไรก็ตาม ในการแสดงให้แสดงเป็นกลุ่ม กลุ่มแรกมีค่าตั้งแต่ 0 - 9 กลุ่มที่สองมีค่าตั้งแต่ 10 - 19 จนถึงกลุ่มสุดท้ายเป็น 90 - 99 ตามลำดับ ในการแสดงไม่ต้องพิมพ์หมายเลขกลุ่ม 
x = int(input())
n =[[],[],[],[],[],[],[],[],[],[]]
while x >=0 :
    if 0<=x<=9:
        n[0].append('*')
    elif 10<=x<=19:
        n[1].append('*')
    elif 20<=x<=29:
        n[2].append('*')
    elif 30<=x<=39:
        n[3].append('*')
    elif 40<=x<=49:
        n[4].append('*')
    elif 50<=x<=59:
        n[5].append('*')
    elif 60<=x<=69:
        n[6].append('*')
    elif 70<=x<=79:
        n[7].append('*')
    elif 80<=x<=89:
        n[8].append('*')
    elif 90<=x<=99:
        n[9].append('*')
    x = int(input())
for i in range(10):
    sum = ''
    for y in n[i]:
        sum = sum+y
    print(":",sum)


# In[ ]:




