#!/usr/bin/env python
# coding: utf-8

# In[32]:


print("CP ALL , 7-Eleven ปตท.ห้วยโป่ง(4062)")
print("TAX#3101578522" "VAT Inclnded""Vat 03945")
print("POS# :6X0190D94080")
print("ใบเสร็จรับเงิน/ใบกำกับภาษี")
print("1 สก็อตต์ เอ็กตร้า            13.00")
print("1  โออิชิ เอมอน แบลี่        20.00")
print("1  แป้งเบบี้มายห์ดับเบิ้ล     11.00 ")
print("1  Not0306 สมุดโน้ต        12.00")
print("1 สิทธิ์แลกซื้อสุดคุ้ม          0.00NP")
print("Total" ,13.00+20.00+11.00+12.00, )
print("Cash/Change 60.00")
print("R#0000663459 P2:5574238  18/08/53 10:57")
print("*ศูนย์ลูกค้าสัมพันธ์ ตจว.1800-226671(โทรฟรี)")


# In[ ]:




